{
  "backend/main.mo": "Motoko canister implementing user profiles, sermon storage with admin-controlled CRUD, and contact form submissions using access control.",
  "feature_evidence.json": "Feature evidence report mapping project features to relevant frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of all major frontend files for reference and documentation.",
  "frontend/index.css": "Global Tailwind-based OKLCH theme variables and base styles defining light/dark palettes and layout defaults.",
  "frontend/index.html": "Root HTML file mounting the React app and loading the main TypeScript entry module.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes for all site pages and wraps the app in a theme provider.",
  "frontend/src/components/cta/PrimaryCTA.tsx": "Reusable primary call‑to‑action button linking to a target route with consistent styling.",
  "frontend/src/components/forms/ContactForm.tsx": "Contact form with validation, backend submission, loading states, and success/error UI handling.",
  "frontend/src/components/forms/FormFeedback.tsx": "Alert component displaying success or error messages with optional dismiss functionality.",
  "frontend/src/components/layout/SiteFooter.tsx": "Footer showing church info, service times, location, and a branded caffeine.ai attribution link.",
  "frontend/src/components/layout/SiteLayout.tsx": "Layout wrapper with header, footer, and routed content via Outlet.",
  "frontend/src/components/media/PageHeaderImage.tsx": "Displays a large header image with optional overlayed children content.",
  "frontend/src/components/nav/SiteHeader.tsx": "Responsive site header with desktop and mobile navigation, highlighting active routes.",
  "frontend/src/components/resources/ResourceList.tsx": "Renders a list of resources with titles, descriptions, and optional external links.",
  "frontend/src/components/scripture/ScriptureQuote.tsx": "Shows a scripture quote with text, reference, and translation.",
  "frontend/src/components/sections/LiturgyList.tsx": "Ordered list of liturgy items with optional descriptions.",
  "frontend/src/components/sections/Section.tsx": "Generic section wrapper with spacing and container styling.",
  "frontend/src/components/sermons/SermonListItem.tsx": "Displays a sermon card with title, metadata, audio link, and navigation to details.",
  "frontend/src/content/confession1689.ts": "Exports structured 1689 confession chapters with titles and paragraphs.",
  "frontend/src/content/scripture.ts": "Provides scripture text objects for various pages and topics.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, invalidating dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity login state and stored identities.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching sermons, service info, and submitting contact forms using the actor.",
  "frontend/src/index.css": "Defines Tailwind layers and custom CSS variables for light/dark themes plus typography and prose styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity context providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with sections describing the church’s identity, history, leadership, and commitments.",
  "frontend/src/pages/BeliefsPage.tsx": "Displays core doctrinal beliefs with explanatory text and scripture quotes, covering gospel, grace, covenant theology, and worship.",
  "frontend/src/pages/ConfessionPage.tsx": "Shows an introduction to the 1689 Confession and renders all chapters with paragraphs and separators.",
  "frontend/src/pages/ContactPage.tsx": "Provides contact and visit information including address, service times, and a contact form.",
  "frontend/src/pages/DiscipleshipPage.tsx": "Presents discipleship teachings on membership, catechism, and family worship with supporting scripture quotes.",
  "frontend/src/pages/HomePage.tsx": "Renders the home page with a hero image, welcome text, scripture quote, service info, and links to beliefs and confession pages.",
  "frontend/src/pages/ResourcesPage.tsx": "Displays categorized Reformed Baptist resources including confessions, catechisms, and recommended reading using ResourceList components.",
  "frontend/src/pages/SermonDetailPage.tsx": "Fetches and displays a single sermon’s details, metadata, audio link, and full text, with loading and error states.",
  "frontend/src/pages/SermonsPage.tsx": "Lists all sermons with loading and error handling, rendering SermonListItem components in a grid.",
  "frontend/src/pages/WorshipPage.tsx": "Describes the church’s worship practices, liturgy order, and visitor expectations, using a header image and LiturgyList.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and clearing URL and session-based parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, fonts, container settings, and animations with typography and other plugins.",
  "project_state.json": "Defines project state and requirements for building a reverent, minimalist church website, including design principles, tone guidelines, required images, and existing feature specifications. Contains architectural notes, page structure expectations, and content constraints."
}